# GetPlaneDirections Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofComponents..::..GetPlaneDirections Method
RoofComponents Class See Also
---
The plane directions of roof slabs.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<XYZ> GetPlaneDirections()
```

Visual Basic
---
```text
Public Function GetPlaneDirections As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetPlaneDirections()
```

# ### Return Value
The directions.
# See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace